import { getAccessGBIF } from "../../../src/BackendScript/models/scan/getAccessGBIF";

//テストコード
// cd ../../src/BackendScript/models
// npx tsx ./getAccessGBIF.ts

// テスト環境設定
//インターネット接続状態で実行
// 　結果正常

//インターネット未接続状態で実行
// 　結果異常で帰ってくる

//該当データありで実施
const testArea: string =
  "POLYGON((140.009 40,140.00636396103067 40.00636396103068,140 40.009,139.99363603896933 40.00636396103068,139.991 40,139.99363603896933 39.99363603896932,140 39.991,140.00636396103067 39.99363603896932,140.009 40))";
getAccessGBIF(testArea);

//該当データなしで実施
const testAreaZero: string =
  "POLYGON((-121.991 -50,-121.99363603896933 -49.99363603896932,-122 -49.991,-122.00636396103067 -49.99363603896932,-122.009 -50,-122.00636396103067 -50.00636396103068,-122 -50.009,-121.99363603896933 -50.00636396103068,-121.991 -50))";
getAccessGBIF(testAreaZero);
